{
	"tooltip": {
		"text": {
			"padding": 5.0,

			# Ship manufacturer & description flavour; all ships using experimental mods will get these applied on them
			"flavourManufacturer": "Experimental",
			"flavourDescription": "This design utilizes experimental hull modifications created by a spacer who has been living in a junkyard for most of his life. His 'treasure hoard' is full of franken-ships that somehow fly by using cannibalized parts from other ships that would be deemed incompatible. Benefits of such modifications are unclear as they do not provide a certain advantage over the stock designs. However the level of customization and flexibility they offer is certainly unparalleled.",

			# Below are various warning and info texts displayed on the experimental modifications
			"warning": "Installing or removing Experimental Hull Modifications will commit the changes immediately, the variant will be saved and any market and/or cargo transactions will be finalized",
			"baseRetrofitWarning": "Will become a built-in hull modification as soon as it is installed",
			"overEngineeredNoEffect": "Has no effects till it is built into the ship using a story point",
			"overEngineeredWarning": "Removal of base experimental hull modification will be blocked if built-in",
			"noShip": "Ship does not exist",
			"lacksBase": "Requires experimental hull modifications base to be installed first",
			"hasSystemRetrofit": "Another system retrofit is already installed",
			"hasWeaponRetrofit": "Another weapon retrofit is already installed",
			"hasAdapterRetrofit": "Another slot adapter retrofit is already installed",
			"hasShieldCosmetic": "Another shield cosmetic modification is already installed",
			"hasEngineCosmetic": "Another engine cosmetic modification is already installed",
			"hasAnyExperimental": "All experimental hull modifications needs to be removed from the ship first",
			"hasAnyExperimentalBuiltIn": "Cannot be used due to an experimental hull modification built-in to the ship with a story point",
			"noShields": "Cannot function without shields",
			"hasPhase": "Cannot function with a phase cloak",
			"noWings": "Cannot function without wings",
			"adapterActivated": "An adapter has been activated. Can only be removed with the adapter removal hull mod",
			"noAdapterRetrofit": "There are no adapters to remove",
			"hasWeapons": "Cannot be installed or uninstalled as long as there are weapons present on the ship",
			"hasWeaponsOnAdaptedSlots": "Cannot be uninstalled as long as adapted slots have weapons or shunts on them",
			"hasWeaponsOnConvertedSlots": "Cannot be uninstalled as long as converted slots have weapons or shunts on them",
		},
		"header": {
			"padding": 15.0,

			# Below are various warning and info header texts displayed on experimental modifications
			"info" : "INFO",
			"warning": "WARNING",
			"noEffect": "NO EFFECT",
			"sEffect": "S-EFFECT",
			"severeWarning": "WARNING", # Uses a flashing effect to distinct itself from a normal warning
			"notApplicable": "NOT APPLICABLE",
			"lockedIn": "LOCKED IN",
			"lockedOut": "LOCKED OUT",

			# Below are hexadecimal RGB colour codes that stylize the headers
			"info_bgColour": "0x000000",
			"info_textColour": "0x518B9E",
			"warning_bgColour": "0x000000",
			"warning_textColour": "0xFFFF00",
			"noEffect_bgColour": "0x000000",
			"noEffect_textColour": "0xFFFF00",
			"sEffect_bgColour": "0x000000",
			"sEffect_textColour": "0xA2ED7F",
			"severeWarning_bgColour": "0x000000",
			"severeWarning_textColour": "0xFF0000",
			"notApplicable_bgColour": "0x000000",
			"notApplicable_textColour": "0xFF0000",
			"locked_bgColour": "0x000000",
			"locked_textColour": "0xFF6600",
		}
	}
}